### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.app.module.preview_url[0].aws_ssm_parameter.central_deployment_account_id will be created
  + resource "aws_ssm_parameter" "central_deployment_account_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/__deployment__/applications/preview-url-mapper/central-deployment-account-id"
      + overwrite      = true
      + region         = "eu-west-1"
      + tags_all       = {
          + "application" = "digitalekanaler-designmanual"
          + "repo"        = "spor"
          + "terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.app.module.preview_url[0].module.ssm_environment_version_permissions.module.ssm_parameter_store[0].data.aws_iam_policy_document.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameterHistory",
              + "ssm:GetParameters",
              + "ssm:GetParametersByPath",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.app.module.preview_url[0].module.ssm_environment_version_permissions.module.ssm_parameter_store[0].aws_iam_role_policy.this will be updated in-place
  ~ resource "aws_iam_role_policy" "this" {
        id          = "platform-digitalekanaler-designmanual-lambda:terraform-20251013132022108200000001"
        name        = "terraform-20251013132022108200000001"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParametersByPath",
                          - "ssm:GetParameters",
                          - "ssm:GetParameterHistory",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/applications/preview-url-mapper/central-deployment-account-id"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 89971a966e9bc53a51ad02c93eb25d3047e513e0*
*Plan generated at: 2026-01-29 08:07:17 UTC*
